export const FightTips: string[] = [
    "金->木->土->水->火->金\n不同属性之间相互克制，巧用属性可以出奇制胜" ,
    "普通属性不克制一切属性\n也不会被其他属性克制"
]

export const PreloadTips: string[] = [
    "天元大陆的人们坚信“天圆地方”的理念\n 因此这片大陆被命名为天方大陆",
    "如果你收集到贵重物品\n可以到天市垣进行交易",
    "天方大陆的人们用五行学说解释物质构成和变化\n 这是他们对物质世界的思考",
    "元气论认为万物由“气”构成\n涉及物质本质的探讨"
]

export const ShopTips: string[] = [
    "欢迎光顾天市垣，请选择购买的商品。",
    "天市垣是中国古代星官之一，象征着繁荣的市场。",
    "在天方大陆的世界里，宠物需要通过罗盘召唤才能响应",
    "蔡effffffffff",
    "不要再点人家了",
    "铜钱是天方大陆的基础货币，可以用来提升宠物等级。",
    "元气是天方大陆的物质组成基础，可以用来提升宠物的星级。",
    "星象罗盘可以用来召唤宠物，成为你的伙伴。"
]

/**
 * 这是一片神秘而时代久远的大陆
这里的人们坚信‘天圆地方’的理论，因此这片大陆被称为天方大陆
由于神秘力量，导致现代人们遗失了基本的物理常识
少女与她的宠物们穿越到这片大陆
寻找遗失的物理常识和丢失的五行元素
在这片土地上，必须利用知识与力量，才能打败困难
 */

export const NewTip: string[] = [
    "这是一片神秘而时代久远的大陆",
    "这里的人们坚信‘天圆地方’的理论，因此这片大陆被称为天方大陆",
    "由于神秘力量，导致现代人们遗失了基本的物理常识",
    "少女与她的宠物们穿越到这片大陆",
    "寻找遗失的物理常识和丢失的五行元素",
    "在这片土地上，必须利用知识与力量，才能打败困难"
]